const textdata = {
longText: "ॐ विश्वं विष्णुर्वषट्कारो भूतभव्यभवत्प्रभुः।<br>भूतकृद्भूतभृद्भावो भूतात्मा भूतभावनः॥१॥\nपूतात्मा परमात्मा च मुक्तानां परमा गतिः।<br>अव्ययः पुरुषः साक्षी क्षेत्रज्ञोऽक्षर एव च॥२॥\nयोगो योगविदां नेता प्रधानपुरुषेश्वरः।<br>नारसिंहवपुः श्रीमान् केशवः पुरुषोत्तमः॥३॥\nसर्वः शर्वः शिवः स्थाणुर्भूतादिर्निधिरव्ययः।<br>संभवो भावनो भर्ता प्रभवः प्रभुरीश्वरः॥४॥\nस्वयंभूः शम्भुरादित्यः पुष्कराक्षो महास्वनः।<br>अनादिनिधनो धाता विधाता धातुरुत्तमः॥५॥\nअप्रमेयो हृषीकेशः पद्मनाभोऽमरप्रभुः।<br>विश्वकर्मा मनुस्त्वष्टा स्थविष्ठः स्थविरो ध्रुवः॥६॥\nअग्राह्यः शाश्वतः कृष्णो लोहिताक्षः प्रतर्दनः।<br>प्रभूतस्त्रिककुब्धाम पवित्रं मङ्गलं परम्॥७॥\nईशानः प्राणदः प्राणो ज्येष्ठः श्रेष्ठः प्रजापतिः।<br>हिरण्यगर्भो भूगर्भो माधवो मधुसूदनः॥८॥\nईश्वरो विक्रमी धन्वी मेधावी विक्रमः क्रमः।<br>अनुत्तमो दुराधर्षः कृतज्ञः कृतिरात्मवान्॥९॥\nसुरेशः शरणं शर्म विश्वरेताः प्रजाभवः।<br>अहः संवत्सरो व्यालः प्रत्ययः सर्वदर्शनः॥१०॥\nअजः सर्वेश्वरः सिद्धः सिद्धिः सर्वादिरच्युतः।<br>वृषाकपिरमेयात्मा सर्वयोगविनिःसृतः॥११॥\nवसुर्वसुमनाः सत्यः समात्माऽसम्मितः समः।<br>अमोघः पुण्डरीकाक्षो वृषकर्मा वृषाकृतिः॥१२॥\nरुद्रो बहुशिरा बभ्रुर्विश्वयोनिः शुचिश्रवाः।<br>अमृतः शाश्वत स्थाणुर्वरारोहो महातपाः॥१३॥\nसर्वगः सर्वविद्भानुर्विष्वक्सेनो जनार्दनः।<br>वेदो वेदविदव्यङ्गो वेदाङ्गो वेदवित् कविः॥१४॥\nलोकाध्यक्षः सुराध्यक्षो धर्माध्यक्षः कृताकृतः।<br>चतुरात्मा चतुर्व्यूहश्चतुर्दंष्ट्रश्चतुर्भुजः॥१५॥\nभ्राजिष्णुर्भोजनं भोक्ता सहिष्णुर्जगदादिजः।<br>अनघो विजयो जेता विश्वयोनिः पुनर्वसुः॥१६॥\nउपेन्द्रो वामनः प्रांशुरमोघः शुचिरूर्जितः।<br>अतीन्द्रः संग्रहः सर्गो धृतात्मा नियमो यमः॥१७॥\nवेद्यो वैद्यः सदायोगी वीरहा माधवो मधुः।<br>अतीन्द्रियो महामायो महोत्साहो महाबलः॥१८॥\nमहाबुद्धिर्महावीर्यो महाशक्तिर्महाद्युतिः।<br>अनिर्देश्यवपुः श्रीमानमेयात्मा महाद्रिधृक्॥१९॥\nमहेष्वासो महीभर्ता श्रीनिवासः सतां गतिः।<br>अनिरुद्धः सुरानन्दो गोविन्दो गोविदां पतिः॥२०॥\nमरीचिर्दमनो हंसः सुपर्णो भुजगोत्तमः।<br>हिरण्यनाभः सुतपाः पद्मनाभः प्रजापतिः॥२१॥\nअमृत्युः सर्वदृक् सिंहः सन्धाता सन्धिमान् स्थिरः।<br>अजो दुर्मर्षणः शास्ता विश्रुतात्मा सुरारिहा॥२२॥\nगुरुर्गुरुतमो धाम सत्यः सत्यपराक्रमः।<br>निमिषोऽनिमिषः स्रग्वी वाचस्पतिरुदारधीः॥२३॥\nअग्रणीर्ग्रामणीः श्रीमान् न्यायो नेता समीरणः।<br>सहस्रमूर्धा विश्वात्मा सहस्राक्षः सहस्रपात्॥२४॥\nआवर्तनो निवृत्तात्मा संवृतः संप्रमर्दनः।<br>अहः संवर्तको वह्निरनिलो धरणीधरः॥२५॥\nसुप्रसादः प्रसन्नात्मा विश्वधृग्विश्वभुग्विभुः।<br>सत्कर्ता सत्कृतः साधुर्जह्नुर्नारायणो नरः॥२६॥\nअसंख्येयोऽप्रमेयात्मा विशिष्टः शिष्टकृच्छुचिः।<br>सिद्धार्थः सिद्धसंकल्पः सिद्धिदः सिद्धिसाधनः॥२७॥\nवृषाही वृषभो विष्णुर्वृषपर्वा वृषोदरः।<br>वर्धनो वर्धमानश्च विविक्तः श्रुतिसागरः॥२८॥\nसुभुजो दुर्धरो वाग्मी महेन्द्रो वसुदो वसुः।<br>नैकरूपो बृहद्रूपः शिपिविष्टः प्रकाशनः॥२९॥\nओजस्तेजोद्युतिधरः प्रकाशात्मा प्रतापनः।<br>ऋद्धः स्पष्टाक्षरो मन्त्रश्चन्द्रांशुर्भास्करद्युतिः॥३०॥\nअमृतांशूद्भवो भानुः शशबिन्दुः सुरेश्वरः।<br>औषधं जगतः सेतुः सत्यधर्मपराक्रमः॥३१॥\nभूतभव्यभवन्नाथः पवनः पावनोऽनलः।<br>कामहा कामकृत्कान्तः कामः कामप्रदः प्रभुः॥३२॥\nयुगादिकृद्युगावर्तो नैकमायो महाशनः।<br>अदृश्यो व्यक्तरूपश्च सहस्रजिदनन्तजित्॥३३॥\nइष्टोऽविशिष्टः शिष्टेष्टः शिखण्डी नहुषो वृषः।<br>क्रोधहा क्रोधकृत्कर्ता विश्वबाहुर्महीधरः॥३४॥\nअच्युतः प्रथितः प्राणः प्राणदो वासवानुजः।<br>अपांनिधिरधिष्ठानमप्रमत्तः प्रतिष्ठितः॥३५॥\nस्कन्दः स्कन्दधरो धुर्यो वरदो वायुवाहनः।<br>वासुदेवो बृहद्भानुरादिदेवः पुरन्दरः॥३६॥\nअशोकस्तारणस्तारः शूरः शौरिर्जनेश्वरः।<br>अनुकूलः शतावर्तः पद्मी पद्मनिभेक्षणः॥३७॥\nपद्मनाभोऽरविन्दाक्षः पद्मगर्भः शरीरभृत्।<br>महर्द्धिरृद्धो वृद्धात्मा महाक्षो गरुडध्वजः॥३८॥\nअतुलः शरभो भीमः समयज्ञो हविर्हरिः।<br>सर्वलक्षणलक्षण्यो लक्ष्मीवान् समितिञ्जयः॥३९॥\nविक्षरो रोहितो मार्गो हेतुर्दामोदरः सहः।<br>महीधरो महाभागो वेगवानमिताशनः॥४०॥\nउद्भवः क्षोभणो देवः श्रीगर्भः परमेश्वरः।<br>करणं कारणं कर्ता विकर्ता गहनो गुहः॥४१॥\nव्यवसायो व्यवस्थानः संस्थानः स्थानदो ध्रुवः।<br>परर्द्धिः परमस्पष्टस्तुष्टः पुष्टः शुभेक्षणः॥४२॥\nरामो विरामो विरजो (or विरतो) मार्गो नेयो नयोऽनयः।<br>वीरः शक्तिमतां श्रेष्ठो धर्मो धर्मविदुत्तमः॥४३॥\nवैकुण्ठः पुरुषः प्राणः प्राणदः प्रणवः पृथुः।<br>हिरण्यगर्भः शत्रुघ्नो व्याप्तो वायुरधोक्षजः॥४४॥\nऋतुः सुदर्शनः कालः परमेष्ठी परिग्रहः।<br>उग्रः संवत्सरो दक्षो विश्रामो विश्वदक्षिणः॥४५॥\nविस्तारः स्थावरस्थाणुः प्रमाणं बीजमव्ययम्।<br>अर्थोऽनर्थो महाकोशो महाभोगो महाधनः॥४६॥\nअनिर्विण्णः स्थविष्ठोऽभूर्धर्मयूपो महामखः।<br>नक्षत्रनेमिर्नक्षत्री क्षमः क्षामः समीहनः॥४७॥\nयज्ञ इज्यो महेज्यश्च क्रतुः सत्रं सतां गतिः।<br>सर्वदर्शी विमुक्तात्मा सर्वज्ञो ज्ञानमुत्तमम्॥४८॥\nसुव्रतः सुमुखः सूक्ष्मः सुघोषः सुखदः सुहृत्।<br>मनोहरो जितक्रोधो वीरबाहुर्विदारणः॥४९॥\nस्वापनः स्ववशो व्यापी नैकात्मा नैककर्मकृत्।<br>वत्सरो वत्सलो वत्सी रत्नगर्भो धनेश्वरः॥५०॥\nधर्मगुब्धर्मकृद्धर्मी सदसत्क्षरमक्षरम्।<br>अविज्ञाता सहस्रांशुर्विधाता कृतलक्षणः॥५१॥\nगभस्तिनेमिः सत्त्वस्थः सिंहो भूतमहेश्वरः।<br>आदिदेवो महादेवो देवेशो देवभृद्गुरुः॥५२॥\nउत्तरो गोपतिर्गोप्ता ज्ञानगम्यः पुरातनः।<br>शरीरभूतभृद्भोक्ता कपीन्द्रो भूरिदक्षिणः॥५३॥\nसोमपोऽमृतपः सोमः पुरुजित्पुरुसत्तमः।<br>विनयो जयः सत्यसंधो दाशार्हः सात्त्वतांपतिः॥५४॥\nजीवो विनयिता साक्षी मुकुन्दोऽमितविक्रमः।<br>अम्भोनिधिरनन्तात्मा महोदधिशयोऽन्तकः॥५५॥\nअजो महार्हः स्वाभाव्यो जितामित्रः प्रमोदनः।<br>आनन्दो नन्दनो नन्दः सत्यधर्मा त्रिविक्रमः॥५६॥\nमहर्षिः कपिलाचार्यः कृतज्ञो मेदिनीपतिः।<br>त्रिपदस्त्रिदशाध्यक्षो महाशृङ्गः कृतान्तकृत्॥५७॥\nमहावराहो गोविन्दः सुषेणः कनकाङ्गदी।<br>गुह्यो गभीरो गहनो गुप्तश्चक्रगदाधरः॥५८॥\nवेधाः स्वाङ्गोऽजितः कृष्णो दृढः संकर्षणोऽच्युतः।<br>वरुणो वारुणो वृक्षः पुष्कराक्षो महामनाः॥५९॥\nभगवान् भगहाऽऽनन्दी वनमाली हलायुधः।<br>आदित्यो ज्योतिरादित्यः सहिष्णुर्गतिसत्तमः॥६०॥\nसुधन्वा खण्डपरशुर्दारुणो द्रविणप्रदः।<br>दिवःस्पृक् सर्वदृग्व्यासो वाचस्पतिरयोनिजः॥६१॥\nत्रिसामा सामगः साम निर्वाणं भेषजं भिषक्।<br>संन्यासकृच्छमः शान्तो निष्ठा शान्तिः परायणम्॥६२॥\nशुभाङ्गः शान्तिदः स्रष्टा कुमुदः कुवलेशयः।<br>गोहितो गोपतिर्गोप्ता वृषभाक्षो वृषप्रियः॥६३॥\nअनिवर्ती निवृत्तात्मा संक्षेप्ता क्षेमकृच्छिवः।<br>श्रीवत्सवक्षाः श्रीवासः श्रीपतिः श्रीमतांवरः॥६४॥\nश्रीदः श्रीशः श्रीनिवासः श्रीनिधिः श्रीविभावनः।<br>श्रीधरः श्रीकरः श्रेयः श्रीमाँल्लोकत्रयाश्रयः॥६५॥\nस्वक्षः स्वङ्गः शतानन्दो नन्दिर्ज्योतिर्गणेश्वरः।<br>विजितात्माऽविधेयात्मा सत्कीर्तिश्छिन्नसंशयः॥६६॥\nउदीर्णः सर्वतश्चक्षुरनीशः शाश्वतस्थिरः।<br>भूशयो भूषणो भूतिर्विशोकः शोकनाशनः॥६७॥\nअर्चिष्मानर्चितः कुम्भो विशुद्धात्मा विशोधनः।<br>अनिरुद्धोऽप्रतिरथः प्रद्युम्नोऽमितविक्रमः॥६८॥\nकालनेमिनिहा वीरः शौरिः शूरजनेश्वरः।<br>त्रिलोकात्मा त्रिलोकेशः केशवः केशिहा हरिः॥६९॥\nकामदेवः कामपालः कामी कान्तः कृतागमः।<br>अनिर्देश्यवपुर्विष्णुर्वीरोऽनन्तो धनंजयः॥७०॥\nब्रह्मण्यो ब्रह्मकृद् ब्रह्मा ब्रह्म ब्रह्मविवर्धनः।<br>ब्रह्मविद् ब्राह्मणो ब्रह्मी ब्रह्मज्ञो ब्राह्मणप्रियः॥७१॥\nमहाक्रमो महाकर्मा महातेजा महोरगः।<br>महाक्रतुर्महायज्वा महायज्ञो महाहविः॥७२॥\nस्तव्यः स्तवप्रियः स्तोत्रं स्तुतिः स्तोता रणप्रियः।<br>पूर्णः पूरयिता पुण्यः पुण्यकीर्तिरनामयः॥७३॥\nमनोजवस्तीर्थकरो वसुरेता वसुप्रदः।<br>वसुप्रदो वासुदेवो वसुर्वसुमना हविः॥७४॥\nसद्गतिः सत्कृतिः सत्ता सद्भूतिः सत्परायणः।<br>शूरसेनो यदुश्रेष्ठः सन्निवासः सुयामुनः॥७५॥\nभूतावासो वासुदेवः सर्वासुनिलयोऽनलः।<br>दर्पहा दर्पदो दृप्तो दुर्धरोऽथापराजितः॥७६॥\nविश्वमूर्तिर्महामूर्तिर्दीप्तमूर्तिरमूर्तिमान्।<br>अनेकमूर्तिरव्यक्तः शतमूर्तिः शताननः॥७७॥\nएको नैकः सवः कः किं यत् तत्पदमनुत्तमम्।<br>लोकबन्धुर्लोकनाथो माधवो भक्तवत्सलः॥७८॥\nसुवर्णवर्णो हेमाङ्गो वराङ्गश्चन्दनाङ्गदी।<br>वीरहा विषमः शून्यो घृताशीरचलश्चलः॥७९॥\nअमानी मानदो मान्यो लोकस्वामी त्रिलोकधृक्।<br>सुमेधा मेधजो धन्यः सत्यमेधा धराधरः॥८०॥\nतेजोवृषो द्युतिधरः सर्वशस्त्रभृतां वरः।<br>प्रग्रहो निग्रहो व्यग्रो नैकशृङ्गो गदाग्रजः॥८१॥\nचतुर्मूर्तिश्चतुर्बाहुश्चतुर्व्यूहश्चतुर्गतिः।<br>चतुरात्मा चतुर्भावश्चतुर्वेदविदेकपात्॥८२॥\nसमावर्तोऽनिवृत्तात्मा दुर्जयो दुरतिक्रमः।<br>दुर्लभो दुर्गमो दुर्गो दुरावासो दुरारिहा॥८३॥\nशुभाङ्गो लोकसारङ्गः सुतन्तुस्तन्तुवर्धनः।<br>इन्द्रकर्मा महाकर्मा कृतकर्मा कृतागमः॥८४॥\nउद्भवः सुन्दरः सुन्दो रत्ननाभः सुलोचनः।<br>अर्को वाजसनः शृङ्गी जयन्तः सर्वविज्जयी॥८५॥\nसुवर्णबिन्दुरक्षोभ्यः सर्ववागीश्वरेश्वरः।<br>महाह्रदो महागर्तो महाभूतो महानिधिः॥८६॥\nकुमुदः कुन्दरः कुन्दः पर्जन्यः पावनोऽनिलः।<br>अमृतांशोऽमृतवपुः सर्वज्ञः सर्वतोमुखः॥८७॥\nसुलभः सुव्रतः सिद्धः शत्रुजिच्छत्रुतापनः।<br>न्यग्रोधोऽदुम्बरोऽश्वत्थश्चाणूरान्ध्रनिषूदनः॥८८॥\nसहस्रार्चिः सप्तजिह्वः सप्तैधाः सप्तवाहनः।<br>अमूर्तिरनघोऽचिन्त्यो भयकृद्भयनाशनः॥८९॥\nअणुर्बृहत्कृशः स्थूलो गुणभृन्निर्गुणो महान्।<br>अधृतः स्वधृतः स्वास्यः प्राग्वंशो वंशवर्धनः॥९०॥\nभारभृत् कथितो योगी योगीशः सर्वकामदः।<br>आश्रमः श्रमणः क्षामः सुपर्णो वायुवाहनः॥९१॥\nधनुर्धरो धनुर्वेदो दण्डो दमयिता दमः।<br>अपराजितः सर्वसहो नियन्ताऽनियमोऽयमः॥९२॥\nसत्त्ववान् सात्त्विकः सत्यः सत्यधर्मपरायणः।<br>अभिप्रायः प्रियार्होऽर्हः प्रियकृत् प्रीतिवर्धनः॥९३॥\nविहायसगतिर्ज्योतिः सुरुचिर्हुतभुग्विभुः।<br>रविर्विरोचनः सूर्यः सविता रविलोचनः॥९४॥\nअनन्तो हुतभुग्भोक्ता सुखदो नैकजोऽग्रजः।<br>अनिर्विण्णः सदामर्षी लोकाधिष्ठानमद्भुतः॥९५॥\nसनात्सनातनतमः कपिलः कपिरव्ययः।<br>स्वस्तिदः स्वस्तिकृत्स्वस्ति स्वस्तिभुक्स्वस्तिदक्षिणः॥९६॥\nअरौद्रः कुण्डली चक्री विक्रम्यूर्जितशासनः।<br>शब्दातिगः शब्दसहः शिशिरः शर्वरीकरः॥९७॥\nअक्रूरः पेशलो दक्षो दक्षिणः क्षमिणांवरः।<br>विद्वत्तमो वीतभयः पुण्यश्रवणकीर्तनः॥९८॥\nउत्तारणो दुष्कृतिहा पुण्यो दुःस्वप्ननाशनः।<br>वीरहा रक्षणः सन्तो जीवनः पर्यवस्थितः॥९९॥\nअनन्तरूपोऽनन्तश्रीर्जितमन्युर्भयापहः।<br>चतुरश्रो गभीरात्मा विदिशो व्यादिशो दिशः॥१००॥\nअनादिर्भूर्भुवो लक्ष्मीः सुवीरो रुचिराङ्गदः।<br>जननो जनजन्मादिर्भीमो भीमपराक्रमः॥१०१॥\nआधारनिलयोऽधाता पुष्पहासः प्रजागरः।<br>ऊर्ध्वगः सत्पथाचारः प्राणदः प्रणवः पणः॥१०२॥\nप्रमाणं प्राणनिलयः प्राणभृत्प्राणजीवनः।<br>तत्त्वं तत्त्वविदेकात्मा जन्ममृत्युजरातिगः॥१०३॥\nभूर्भुवःस्वस्तरुस्तारः सविता प्रपितामहः।<br>यज्ञो यज्ञपतिर्यज्वा यज्ञाङ्गो यज्ञवाहनः॥१०४॥\nयज्ञभृद् यज्ञकृद् यज्ञी यज्ञभुक् यज्ञसाधनः।<br>यज्ञान्तकृद् यज्ञगुह्यमन्नमन्नाद एव च॥१०५॥\nआत्मयोनिः स्वयंजातो वैखानः सामगायनः।<br>देवकीनन्दनः स्रष्टा क्षितीशः पापनाशनः॥१०६॥\nशङ्खभृन्नन्दकी चक्री शार्ङ्गधन्वा गदाधरः।<br>रथाङ्गपाणिरक्षोभ्यः सर्वप्रहरणायुधः॥१०७॥\nसर्वप्रहरणायुध ॐ नम इति ॥१०८॥"
};

  const datastor = textdata.longText.split('\n');
  const container = document.querySelector('.container');

  const startText = document.createElement("p");
  startText.setAttribute("class", "ending");
  startText.innerHTML = "<b>श्रीविष्णवे नमः</b>";
  container.appendChild(startText);

  datastor.forEach((line,i) => {
  const keyDivs = document.createElement("div");
  keyDivs.setAttribute("class", "key");
  // keyDivs.innerHTML = `<a href='bhashy/visnuBhashyam (${i+1}).html' class='index' style='float:left';>&#8663;</a>${line}`;
  keyDivs.innerHTML = line;
  container.appendChild(keyDivs);
  });

  const lastText = document.createElement("p");
  lastText.setAttribute("class", "ending");
  lastText.innerHTML = "<b>समाप्तं विष्णुसहस्रनामस्तोत्रम्</b>";
  container.appendChild(lastText);
  

const keys = document.querySelectorAll('.key');
const divLen = container.querySelectorAll(".key").length;

// Create an array of audio files
const audioFiles = [];
for (let i = 1; i <= divLen; i++) {
  audioFiles.push(`path-dhvani/visnusahastranamAudios/key (${i}).mp3`);
}

// Add an audio element to each key div
keys.forEach((key, index) => {
  const audio = new Audio(audioFiles[index]);
  audio.setAttribute('data-index', index);
  key.appendChild(audio);
});

let selector1 = document.querySelector('#selector1');
let selector2 = document.querySelector('#selector2');

keys.forEach(function(key, i){
  var option = document.createElement('option');
  var x = key.innerText;
  option.text = x.substring(x.search(/॥/)+1).slice(0,-1);
  option.value = i + 1;
  selector1.appendChild(option); 

  var option2 = document.createElement('option');
  option2.text =x.substring(x.search(/॥/)+1).slice(0,-1);
  option2.value = i + 1;
  selector2.appendChild(option2);
  }); 

  // for(var i=0; i<keys.length; i++) {
  //   var option = document.createElement('option');
  //   option.text = (i + 1) + " तः";
  //   option.value = i +1;
  //   selector1.appendChild(option); 

  //   var option2 = document.createElement('option');
  //   option2.text = (i + 1) + " पर्यन्तम्";
  //   option2.value = i + 1;
  //   selector2.appendChild(option2);
  // }
  //selected option
  
  selector1.selectedIndex = 0;
  selector2.selectedIndex = keys.length-1;
  selector1.addEventListener('change', (event) => {
    const selectedOption = event.target.value;
    const allOptions = selector1.querySelectorAll('option');
    const selectedIndex = Array.from(allOptions).findIndex(option => option.value === selectedOption);
  
    selector2.innerHTML = ''; // Clear existing options in selector 2
    for (let i = selectedIndex; i < allOptions.length; i++) {
      const option = document.createElement('option');
      option.value = allOptions[i].value;
      option.textContent = allOptions[i].textContent;
      selector2.appendChild(option);  
    }
    // Set the value of selector2 to the same value as selector1
    selector2.value = selectedOption;
    // selector2.selectedIndex = selector2.options.length-1;
     playButton.click();
  });

   selector2.addEventListener('change', () => {
     playButton.click();
   });